AlmAck/svdtonuttx/demo/h/da1470x_i2c3.h
/* I2C3_ENABLE_STATUS Register */

#define I2C3_SLV_RX_DATA_LOST                      (1U << 2) /* Slave Received Data Lost. This bit indicates if a Slave-Receiver operation has b */
#define I2C3_SLV_DISABLED_WHILE_BUSY               (1U << 1) /* Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential */
#define I2C3_IC_EN                                 (1U << 0) /* ic_en Status. This bit always reflects the value driven on the output port ic_en */

/* I2C3_FS_SCL_HCNT Register */

#define I2C3_IC_FS_SCL_HCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_FS_SCL_HCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_FS_SCL_LCNT Register */

#define I2C3_IC_FS_SCL_LCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_FS_SCL_LCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_HS_MADDR Register */

#define I2C3_I2C_IC_HS_MAR_MASK                    (0x7 << 0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */
#define I2C3_I2C_IC_HS_MAR_POS                     (0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */

/* I2C3_HS_SCL_HCNT Register */

#define I2C3_IC_HS_SCL_HCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_HS_SCL_HCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_HS_SCL_LCNT Register */

#define I2C3_IC_HS_SCL_LCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_HS_SCL_LCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_IC_FS_SPKLEN Register */

#define I2C3_I2C_FS_SPKLEN_MASK                    (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_I2C_FS_SPKLEN_POS                     (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_IC_HS_SPKLEN Register */

#define I2C3_I2C_HS_SPKLEN_MASK                    (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_I2C_HS_SPKLEN_POS                     (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_INTR_MASK Register */

#define I2C3_M_SCL_STUCK_AT_LOW                    (1U << 14) /* M_SCL_STUCK_AT_LOW Register field Reserved bits */
#define I2C3_M_MASTER_ON_HOLD                      (1U << 13) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RESTART_DET                         (1U << 12) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_GEN_CALL                            (1U << 11) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_START_DET                           (1U << 10) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_STOP_DET                            (1U << 9) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_ACTIVITY                            (1U << 8) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RX_DONE                             (1U << 7) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_TX_ABRT                             (1U << 6) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RD_REQ                              (1U << 5) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_TX_EMPTY                            (1U << 4) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_TX_OVER                             (1U << 3) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RX_FULL                             (1U << 2) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RX_OVER                             (1U << 1) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C3_M_RX_UNDER                            (1U << 0) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */

/* I2C3_INTR_STAT Register */

#define I2C3_R_SCL_STUCK_AT_LOW                    (1U << 14) /* 1 = R_SCL_STUCK_AT_LOW interrupt is active 0 = R_SCL_STUCK_AT_LOW interrupt is i */
#define I2C3_R_MASTER_ON_HOLD                      (1U << 13) /* Indicates whether master is holding the bus and TX FIFO is empty. Enabled only w */
#define I2C3_R_RESTART_DET                         (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C3_R_GEN_CALL                            (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C3_R_START_DET                           (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C3_R_STOP_DET                            (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C3_R_ACTIVITY                            (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C3_R_RX_DONE                             (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C3_R_TX_ABRT                             (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C3_R_RD_REQ                              (1U << 5) /* This bit is set to 1 when the controller is acting as a slave and another I2C ma */
#define I2C3_R_TX_EMPTY                            (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C3_R_TX_OVER                             (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C3_R_RX_FULL                             (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C3_R_RX_OVER                             (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C3_R_RX_UNDER                            (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

