AlmAck/svdtonuttx/demo/h/da1470x_i2c3.h
/* I2C3_RAW_INTR_STAT Register */

#define I2C3_SCL_STUCK_AT_LOW                      (1U << 14) /* CL_STUCK_AT_LOW Register field Reserved bits */
#define I2C3_MASTER_ON_HOLD                        (1U << 13) /* ndicates whether master is holding the bus and TX FIFO is empty. Enabled only wh */
#define I2C3_RESTART_DET                           (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C3_GEN_CALL                              (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C3_START_DET                             (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C3_STOP_DET                              (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C3_ACTIVITY                              (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C3_RX_DONE                               (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C3_TX_ABRT                               (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C3_RD_REQ                                (1U << 5) /* This bit is set to 1 when I2C Ctrl is acting as a slave and another I2C master i */
#define I2C3_TX_EMPTY                              (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C3_TX_OVER                               (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C3_RX_FULL                               (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C3_RX_OVER                               (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C3_RX_UNDER                              (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */

/* I2C3_RXFLR Register */

#define I2C3_RXFLR_MASK                            (0x3F << 0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */
#define I2C3_RXFLR_POS                             (0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */

/* I2C3_RX_TL Register */

#define I2C3_RX_TL_MASK                            (0x1F << 0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */
#define I2C3_RX_TL_POS                             (0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */

/* I2C3_SAR Register */

#define I2C3_IC_SAR_MASK                           (0x3FF << 0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */
#define I2C3_IC_SAR_POS                            (0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */

/* I2C3_SDA_HOLD Register */

#define I2C3_I2C_SDA_RX_HOLD_MASK                  (0xFF << 16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C3_I2C_SDA_RX_HOLD_POS                   (16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C3_I2C_SDA_TX_HOLD_MASK                  (0xFFFF << 0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */
#define I2C3_I2C_SDA_TX_HOLD_POS                   (0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */

/* I2C3_SDA_SETUP Register */

#define I2C3_SDA_SETUP_MASK                        (0xFF << 0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */
#define I2C3_SDA_SETUP_POS                         (0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */

/* I2C3_SS_SCL_HCNT Register */

#define I2C3_IC_SS_SCL_HCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_SS_SCL_HCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_SS_SCL_LCNT Register */

#define I2C3_IC_SS_SCL_LCNT_MASK                   (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C3_IC_SS_SCL_LCNT_POS                    (0) /* This register must be set before any I2C bus transaction can take place to ensur */

/* I2C3_STATUS Register */

#define I2C3_LV_HOLD_RX_FIFO_FULL                  (1U << 10) /* This bit indicates the BUS Hold in Slave mode due to Rx FIFO is Full and an addi */
#define I2C3_SLV_HOLD_TX_FIFO_EMPTY                (1U << 9) /* This bit indicates the BUS Hold in Slave mode for the Read request when the Tx F */
#define I2C3_MST_HOLD_RX_FIFO_FULL                 (1U << 8) /* This bit indicates the BUS Hold in Master mode due to Rx FIFO is Full and additi */
#define I2C3_MST_HOLD_TX_FIFO_EMPTY                (1U << 7) /* the DW_apb_i2c master stalls the write transfer when Tx FIFO is empty, and the t */
#define I2C3_SLV_ACTIVITY                          (1U << 6) /* Slave FSM Activity Status. When the Slave Finite State Machine (FSM) is not in t */
#define I2C3_MST_ACTIVITY                          (1U << 5) /* Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in */
#define I2C3_RFF                                   (1U << 4) /* Receive FIFO Completely Full. When the receive FIFO is completely full, this bit */
#define I2C3_RFNE                                  (1U << 3) /* Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or mo */
#define I2C3_TFE                                   (1U << 2) /* Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this */
#define I2C3_TFNF                                  (1U << 1) /* Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty lo */
#define I2C3_I2C_ACTIVITY                          (1U << 0) /* I2C Activity Status. */

/* I2C3_TAR Register */

#define I2C3_SPECIAL                               (1U << 11) /* On read This bit indicates whether software performs a General Call or START BYT */
#define I2C3_GC_OR_START                           (1U << 10) /* On read If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a Gener */
#define I2C3_IC_TAR_MASK                           (0x3FF << 0) /* This is the target address for any master transaction. When transmitting a Gener */
#define I2C3_IC_TAR_POS                            (0) /* This is the target address for any master transaction. When transmitting a Gener */

