AlmAck/svdtonuttx/demo/h/da1470x_i2c3.h
/* I2C3_TXFLR Register */

#define I2C3_TXFLR_MASK                            (0x3F << 0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */
#define I2C3_TXFLR_POS                             (0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */

/* I2C3_TX_ABRT_SOURCE Register */

#define I2C3_ABRT_USER_ABRT                        (1U << 16) /* Master-Transmitter : This is a master-mode-only bit. Master has detected the tra */
#define I2C3_ABRT_SLVRD_INTX                       (1U << 15) /* Slave-Transmitter : When the processor side responds to a slave mode request for */
#define I2C3_ABRT_SLV_ARBLOST                      (1U << 14) /* Slave-Transmitter : Slave lost the bus while transmitting data to a remote maste */
#define I2C3_ABRT_SLVFLUSH_TXFIFO                  (1U << 13) /* Slave-Transmitter : Slave has received a read command and some data exists in th */
#define I2C3_ARB_LOST                              (1U << 12) /* Master-Transmitter or Slave-Transmitter : Master has lost arbitration, or if I2C */
#define I2C3_ABRT_MASTER_DIS                       (1U << 11) /* Master-Transmitter or Master-Receiver : User tries to initiate a Master operatio */
#define I2C3_ABRT_10B_RD_NORSTRT                   (1U << 10) /* Master-Receiver : The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) a */
#define I2C3_ABRT_SBYTE_NORSTRT                    (1U << 9) /* Master : To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed firs */
#define I2C3_ABRT_HS_NORSTRT                       (1U << 8) /* Master-Transmitter or Master-Receiver : The restart is disabled (IC_RESTART_EN b */
#define I2C3_ABRT_SBYTE_ACKDET                     (1U << 7) /* Master : Master has sent a START Byte and the START Byte was acknowledged (wrong */
#define I2C3_ABRT_HS_ACKDET                        (1U << 6) /* Master : Master is in High Speed mode and the High Speed Master code was acknowl */
#define I2C3_ABRT_GCALL_READ                       (1U << 5) /* Master-Transmitter : The controller in master mode sent a General Call but the u */
#define I2C3_ABRT_GCALL_NOACK                      (1U << 4) /* Master-Transmitter : the controller in master mode sent a General Call and no sl */
#define I2C3_ABRT_TXDATA_NOACK                     (1U << 3) /* Master-Transmitter : This is a master-mode only bit. Master has received an ackn */
#define I2C3_ABRT_10ADDR2_NOACK                    (1U << 2) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define I2C3_ABRT_10ADDR1_NOACK                    (1U << 1) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define I2C3_ABRT_7B_ADDR_NOACK                    (1U << 0) /* Master-Transmitter or Master-Receiver : Master is in 7-bit addressing mode and t */

/* I2C3_TX_TL Register */

#define I2C3_TX_TL_MASK                            (0x1F << 0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */
#define I2C3_TX_TL_POS                             (0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */

#endif /* __DA1470X_I2C3_H */
